tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/coalCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      coalCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

InjectionModel  ManualInjection;

DragModel       SphereDrag;

DispersionModel StochasticDispersionRAS;

PatchInteractionModel StandardWallInteraction;

HeatTransferModel RanzMarshall;

CompositionModel SingleMixtureFraction;

PhaseChangeModel LiquidEvaporation;

DevolatilisationModel ConstantRateDevolatilisation;

SurfaceReactionModel COxidationDiffusionLimitedRate;

PostProcessingModel none;

radiation       on;

coupled         true;

cellValueSourceCorrection on;

parcelTypeId    1;

constantProperties
{
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 1e-15;
    TMin            TMin [ 0 0 0 1 0 ] 200;
    pMin            pMin [ 1 -1 2 0 0 ] 1000;
    minParticleMass minParticleMass [ 1 0 0 0 0 ] 1e-15;
    rho0            rho0 [ 1 -3 0 0 0 ] 1000;
    T0              T0 [ 0 0 0 1 0 ] 300;
    cp0             cp0 [ 0 2 -2 -1 0 ] 4187;
    epsilon0        epsilon0 [ 0 0 0 0 0 ] 1;
    f0              f0 [ 0 0 0 0 0 ] 0.5;
    Pr              Pr [ 0 0 0 0 0 ] 0.7;
    Tvap            Tvap [ 0 0 0 1 0 ] 400;
    Tbp             Tvap [ 0 0 0 1 0 ] 400;
    LDevol          LDevol [ 0 0 0 0 0 ] 0;
    hRetentionCoeff hRetentionCoeff [ 0 0 0 0 0 ] 1;
    constantVolume  true;
}

interpolationSchemes
{
    rho             cell;
    U               cellPointFace;
    mu              cell;
    T               cell;
    Cp              cell;
    p               cell;
}

integrationSchemes
{
    U               Euler;
    T               Analytical;
}

particleForces
{
    gravity         on;
    virtualMass     off;
    pressureGradient off;
}

ManualInjectionCoeffs
{
    massTotal       massTotal [ 1 0 0 0 0 ] 0.0001;
    parcelBasisType mass;
    SOI             0;
    positionsFile   "coalCloud1Positions";
    U0              ( 0 -10 0 );
    parcelPDF
    {
        pdfType         RosinRammler;
        RosinRammlerPDF
        {
            minValue        5e-06;
            maxValue        0.0005;
            d               ( 5e-05 );
            n               ( 0.5 );
        }
    }
}

StandardWallInteractionCoeffs
{
    type            rebound;
    e               1; // optional
    mu              0; // optional
}

RanzMarshallCoeffs
{
    // thermal shielding
    BirdCorrection  true;
}

SingleMixtureFractionCoeffs
{
    phases
    (
        gas
        {
            CH4 0.604;
            H2 0.099;
            CO2 0.297;
        }
        liquid
        {
            H2O 1;
        }
        solid
        {
            ash 0.136304;
            C 0.863696;
        }
    );
    YGasTot0        0.211;
    YLiquidTot0     0.026;
    YSolidTot0      0.763;
}

LiquidEvaporationCoeffs
{
    enthalpyTransfer enthalpyDifference;

    activeLiquids
    (
        H2O
    );
}

ConstantRateDevolatilisationCoeffs
{
    A0              A0 [ 0 0 -1 0 0 ] 12;
    volatileResidualCoeff 0.001;
}

COxidationDiffusionLimitedRateCoeffs
{
    Sb              Sb [ 0 0 0 0 0 ] 1;
    D               D [ 0 2 -1 0 0 ] 1.5e-05;
}

// ************************************************************************* //
